php script/file.txt

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="https://sigag.tais.ru/SIG/"><SOAP-ENV:Body><ns1:SIG_Request><ns1:SIG_AirBookRQ CustomerID="Moyagent"><ns1:SelectedShopOption SessionID="21052517551744493007" OptionRef="0"><ns1:SelectedItinerary ItineraryRef="0"/></ns1:SelectedShopOption><ns1:Add><ns1:Passengers><ns1:Passenger PaxRef="pass2541_2021052520585689258360ad3ae0e0e7d5_91099445" Title="MR" LastName="PUGACH" FirstName="ROMAN ANDREEVICH" AgeType="ADT" DOB="1999-01-13" DocType="PS" DocCountry="RU" DocNumber="7418996812"/></ns1:Passengers><ns1:Contacts><ns1:Contact ContactRef="pass2541_2021052520585689258360ad3ae0e0e7d5_91099445" TypeOfContact="Email">romario89rus@gmail.com</ns1:Contact><ns1:Contact ContactRef="pass2541_2021052520585689258360ad3ae0e0e7d5_91099445" TypeOfContact="Mobile phone">79884940097</ns1:Contact></ns1:Contacts></ns1:Add></ns1:SIG_AirBookRQ></ns1:SIG_Request></SOAP-ENV:Body></SOAP-ENV:Envelope>